Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_384-Glorious_King_of_Tantras_That_Resolves_All_Secrets-v1.tmx
Source language: bo
Languages: en

source: །འདོད་ཆགས་ཇི་ལྟར་རྣམ་པར་དག
en: How is desire purified?

source: །གཡས་གཡོན་སྟེང་འོག་བཞི་ལས་ནི། །ལྔ་པ་ནམ་མཁའ་འབྱུང་བ་ཡིན།
en: From the four of right, left, above and below, Emerges space, the fifth.

source: །ལྔ་པ་རང་བཞིན་མེད་པ་སྟེ། ། དྲུག་པ་ཞེས་ནི་གསུངས་པ་ཡིན།
en: The fifth’s absence of nature Is taught to be the sixth.

source: །དགའ་བ་མཆོག་དགའ་ལྷན་ཅིག་དགའ། །བྲལ་བའི་དགའ་བ་སྔོན་འགྲོ་བས། །ལྔ་པ་བདེ་བ་ཆེན་པོ་འབྱུང་།
en: Preceded by joy, supreme joy, Innate joy, and the freedom from joy, Great bliss, the fifth, emerges.

source: །བདེ་ཆེན་རང་བཞིན་མེད་པ་དག །འོག་གི་སྒོ་ཡི་དྲུག་པ་ཡིན།
en: Great bliss being pure, devoid of nature, Is the sixth, pertaining to the lower door.

source: །དེ་ཕྱིར་དྲུག་པ་འདོད་པས་ཀྱང་། །བཞི་པ་སྔོན་དུ་སོང་བ་ཡིས། །ལྔ་པ་ཡོངས་སུ་རྫོགས་པ་བསྒོམ།
en: Therefore, even those who aspire for the sixth Meditate on the complete fifth, Preceded by the fourth.

source: །དཔེར་ན་ཟངས་ཀྱི་དངོས་པོ་ལ། །གསེར་འགྱུར་རྩི་ཡི་ནུས་པ་ཡིས།
en: For example, when the power of alchemy Is applied to a copper object,

source: །ཟངས་ཉིད་གསེར་དུ་གྱུར་པ་སྟེ། །ཟངས་ལས་མ་གཏོགས་གསེར་ཉིད་དང་།
en: The copper itself becomes gold, And the gold itself comes from just copper.

source: །ལྔ་པ་ལས་གཞན་དྲུག་པ་ནི། །སངས་རྒྱས་ཀྱིས་ཀྱང་མ་གསུངས་སོ།
en: Likewise, the Buddha does not teach That the sixth appears from anything but the fifth.

source: །ལོ་དང་ཟླ་བ་ཟླ་བ་ཕྱེད། །ཉིན་ཞག་དུས་དྲུག་དུས་གཉིས་ལ།
en: Throughout a year, month, fortnight, A day, night, and hour,

source: །སྐད་ཅིག་རེ་ཙམ་དྲུག་ལ་འབྱུང་།
en: The sixth emerges for only a moment.

source: །ལས་དང་པོ་ཡི་སྤྱོད་ཡུལ་མིན།
en: It is not the purview of beginners.

source: །ཆུ་ལ་བརྟེན་ནས་བདུད་རྩི་ཡང་། །ཉམས་སུ་མྱོང་བར་བྱེད་པ་
en: Still, based on water, The ambrosia is also caused to be experienced.

source: །དཔེར་ན་ཆུ་ཡི་སྣོད་ནང་དུ། །བདུད་རྩི་ཐིགས་པ་གཅིག་གཞག་པ།
en: In the same way, a drop of ambrosia Placed in a vessel of water

source: །ཆུ་རུ་ཉམས་སུ་མྱོང་བ་ལས། །ཅིག་ཤོས་ཉམས་སུ་མྱོང་བ་མེད།
en: Is only experienced as water. The ambrosia is not experienced.

source: །དེ་བཞིན་སྤྲོས་བཅས་ལྔ་པ་ལ། །བརྟེན་ནས་སྤྲོས་མེད་དྲུག་པ་འབྱུང་།
en: Likewise, based on the elaborate fifth, The simple sixth emerges.

source: །རྒྱུད་གཞན་དུ་ནི་ང་ཡིས་གསུངས།
en: I have taught this in other tantras.

source: །མཚན་མ་ལྔ་འམ་རོ་བརྒྱད་དམ། །ས་བརྒྱད་ནོན་ནས་མངོན་ཤེས་ལྡན། །ལས་ཀྱི་ཕྱག་རྒྱ་ཡོངས་སུ་སྤངས་།
en: A person who has traversed the five signs, the eight flavors, Or the eight levels, and has thus become clairvoyant, Has fully relinquished the action seal.

source: །ཡེ་ཤེས་ཕྱག་རྒྱ་ལ་གནས་ཤིང་། །ཕྱག་རྒྱ་ཆེན་པོ་ལ་འཇུག་པ།
en: One who engages in the great seal, Adhering to a gnosis seal,

source: །འདི་ནི་གང་ཟག་མཆོག་ཡིན་ཏེ། །འདི་ཡིས་དྲུག་པ་ཟིན་པར་བཤད།
en: Is a superior person. It is explained that he has seized the sixth.

source: །འདོད་ཆགས་ཞེས་པ་འཁོར་བ་སྟེ། །རྣམ་དག་མྱ་ངན་འདས་པར་གསུངས།
en: Desire is cyclic existence; Its purification is taught to be nirvana.

source: །དེ་ནས་གསང་བ་གཉིས་པ་ཡང་།
en: Next is the second secret.

source: །གསང་བའི་དབང་དང་འབྲེལ་བ་སྟེ། །རྟེན་ཅིང་འབྲེལ་པ་ཟབ་མོའི་དོན།
en: It is the profound meaning of dependent origination In connection with the secret initiation.

source: ། འཁོར་ལོའི་གནས་དང་འཁོར་ལོ་དང་། །དེ་ནས་བསྒྲུབ་བྱ་ཤེས་པར་བྱ།
en: Know the locations of the chakras, the chakras themselves, And their related practices.

source: །དང་པོ་ལྷ་ཡི་ང་རྒྱལ་བྱ།
en: First, give rise to the divine pride.

source: །མཁའ་འགྲོ་རྩ་རུ་ཤེས་པར་བྱ།
en: Know that the ḍākinīs are the channels.

source: །དཔའ་བོ་བྱང་ཆུབ་སེམས་སུ་ཤེས།
en: Know that the ḍākas are the spirit of enlightenment.

source: དབང་གི་གནས་དང་འཁོར་ལོའི་གནས། །བླ་མའི་ཞལ་ནས་ཤེས་པར་བྱ།
en: The locations of the initiations and the chakras Should be learned from a master’s oral instructions.

source: །སོར་བཞི་རྟ་མགྲིན་གནས་ཡིན
en: Four finger-widths is the location of Hayagrīva.

source: །སོར་གསུམ་ལ་ནི་འཁོར་ལོ་རེ།
en: Each chakra is three finger-widths,

source: །སྐུ་གསུང་ཐུགས་ཀྱི་རང་བཞིན
en: the nature of enlightened body, speech, and mind.

source: །གནས་གསུམ་གསང་བའི་གནས་ཡིན་ཏེ། །དེ་བཞིན་གནས་གསུམ་རིག་པའོ།
en: Three spaces is the secret location. Likewise, three spaces marks the chakra of awareness.

source: །ཚངས་མདོ་མེ་ལ་གཞང་ཁ་རླུང་། །སོར་གསུམ་སོར་བཞི་མཁས་པས་བརྟག
en: An adept must determine whether the wind of the anus Is three or four finger-widths from the fire of the Brahma confluence.

source: །བདེ་བ་ཆེན་པོའི་འཁོར་ལོ་ནས། །ཚངས་མདོའི་བར་དུ་སོར་མོའི་ཚད། །བཅུ་ཚན་བཞི་དང་བརྒྱད་ཡིན་
en: The distance from the chakra of great bliss To the confluence of Brahma Is forty-eight finger-widths.

source: །དང་པོར་ཕྱི་ཡི་བདུད་རྩི་བསྟེན།
en: Firstly, one enjoys the outer ambrosia.

source: །བདུད་རྩི་ལྔ་དང་ཤ་ལྔ་ལ། །ལྕགས་ཀྱུ་ལྔ་ནི་དགོད་པ་
en: Arrange the five hooks In the five ambrosias and the five meats.

source: །བརྒྱད་དང་བཅུ་བཞི་དང་པོར་འཛག །སི་ཧླ་མི་བསྐྱོད་ལུད་སྐམ་བླང་། །བཅུ་གཉིས་བཅུ་དྲུག་དང་པོར་འཛག །ཧེ་རུ་ཀ་དང་རྣམ་སྣང་དང་། །ལུད་སྐམ་སྙིང་པོ་བླང་བར་བྱ།
en: This should begin on the eighth and fourteenth days of the month. One should then gather silha wood, Akṣobhya, and dry manure. This should begin on the twelfth and sixteenth days of the month. One should then take Heruka, Vairocana, and essence of dry manure.

source: །སེང་གེའི་གཟུགས་ནི་དཀར་པོ་བཟང་། །ལུས་ངག་སྡོམ་ཞིང་ཉེས་པ་མེད།
en: The appearance of the lion should be white and excellent, Its body and speech gentle and without any fault

source: །འདི་ནི་ཤ་ཡི་སྒྲུབ་པའི་རྟེན།
en: This is the basis for the formation of flesh.

source: །བླ་མའི་ཞལ་ནས་ཤེས་པར་བྱ།
en: Should be learned from a master’s oral instructions.

source: །སོར་བརྒྱད་གསང་བ་བདེ་སྐྱོང་གནས།
en: Eight finger-widths is the location of Secret Guardian of Bliss.

source: །རྣལ་འབྱོར་ཕ་དང་རྣལ་འབྱོར་མའི།
en: Of male and female practitioners,

source: །ལུས་ཀྱི་རྟེན་གྱི་བྱེ་བྲག་ལས།
en: Based on the particularities of the bodily supports

source: །སོར་མོ་བཞི་བཅུ་བརྒྱད་ཉིད་ལས། །བརྒྱད་ནི་གསང་བའི་འཁོར་ལོའི་གནས། །བཞི་བཅུ་ལ་ནི་འཁོར་ལོ་གཞན།
en: Forty-eight finger-widths can be divided. In this way, at eight finger-widths is located the secret chakra. The other chakras, located within forty finger-widths,

source: །ཐམས་ཅད་སྒལ་ཚིགས་དབྱུག་གུ་སྟེ། །ཕྱི་དང་ནང་དུ་མཁས་པས་བརྟག
en: An adept should determine all of them As being inside or outside of the spinal column.

source: །རྐྱེན་དང་གསང་བ་རང་བཞིན་དང་། །དབང་དང་རྣམ་པ་བཞི་རུ་གསུངས།
en: Chakras are also taught as four-fold: Conditional, secret, natural, and empowered.

source: །འཁོར་ལོ་ལ་ཡང་རྣམ་པ་གཉིས། །དང་པོར་འཁོར་ལོ་གཉིས་པ་རྩ།
en: There are also two types of chakra. First are the chakras themselves; second the channels.

source: །རྐྱེན་ལ་གཉིས་ཏེ་གསང་བ་བཞི། །རང་བཞིན་བཅུ་དྲུག་དབང་ནི་གཉིས།
en: There are two conditional, four secret, Sixteen natural, and two empowered chakras.

source: །ཙཎྜ་ལཱི་ནི་ཉི་ཤུ་བཞི། །འཁོར་ལོ་བཞི་རུ་སྦས་པ་
en: Caṇḍālī, twenty-four, Are hidden in the four chakras.

source: །བླ་མ་ཚོགས་ནང་མཐོང་ན་རྒྱབ་ཀྱིས་ཕྱོགས།
en: If you turn away from the master in a gathering,

source: །མན་ངག་གཞན་དུ་སྤེལ་ཞིང་འཕྱར་ལ་དགའ།
en: Spread his oral instructions or bandy them about,

source: །འདོད་ཆགས་སྤྱོད་ཕྱིར་སྦས་པའི་རིམ་པ་ནོད།
en: Receive the concealed stage in order to indulge in desire,

source: །གབ་པའི་དོན་ལ་རྒྱབ་ཕྱོགས་སྐུར་པ་འདེབས།
en: Turn away from, or disparage the hidden points,

source: །གསང་སྔགས་བར་གཅོད་རྣལ་འབྱོར་གཞན་ལ་གཤེ།
en: Obstruct the secret mantra, or insult other practices,

source: །འདི་ནི་མནར་མེད་སེམས་དམྱལ་ཆེན་པོར་སྐྱེ།
en: You will be reborn in the great hell of Endless Torment,

source: །སངས་རྒྱས་སྟོང་རྩ་གཅིག་རྫོགས་ཚེ་ཡི་ཚད།
en: Until the thousand and one buddhas are all gone.

source: ་སྦས་ཀྱི་ཐམས་ཅད་ལ། །ང་ཡིས་སྦ་བར་མ་གསུངས
en: I have not said to keep concealed Anything that is concealed

source: །དེ་ཕྱིར་རྒྱུད་གཞན་དུ་ནི་སྦས།
en: Thus, what in other tantras has been hidden,

source: །རྒྱུད་འདིར་ང་ཡིས་རྒྱས་པར་བཤད།
en: In this tantra I explain in detail.

source: །སུམ་ཅུ་རྩ་གཉིས་གཡས་གཡོན་ཆ། །དྲུག་ཅུ་རྩ་བཞི་གྲངས་སུ་སྦས།
en: Thirty-two, divided into left and right parts, Is concealed in the amount of sixty-four.

source: །སུམ་ཅུ་རྩ་གཉིས་ལས་ནི་ཟུང་། །བཅུ་དྲུག་གྲངས་སུ་སྦས་པ་ཡིན།
en: Thirty-two, paired, Is concealed in the amount of sixteen.

source: ། སུམ་ཅུ་རྩ་གཉིས་ཕྱོགས་དང་མཚམས། །བརྒྱད་ཀྱི་གྲངས་སུ་སྦས་པའོ།
en: Thirty-two, grouped according to cardinal and intermediate directions, Is concealed in the amount of eight.

source: །སྤྱི་གཙུག་འཁོར་ལོ་སྤྱི་བོར་སྦས།
en: The crown chakra is concealed at the crown.

source: །གསང་བ་བདེ་སྐྱོང་ལྟེ་བར་སྦས།
en: Secret Guardian of Bliss is concealed at the navel.

source: །བཅུ་དྲུག་ལས་ནི་ཟུང་འགྱུར་བ། །བརྒྱད་ཀྱི་གྲངས་སུ་སྦས་པ་ཡིན།
en: Sixteen, paired, Is concealed in the amount of eight.

source: །བཅུ་དྲུག་ལས་ནི་གཡས་གཡོན་ཆ། ། སུམ་ཅུ་རྩ་གཉིས་གྲངས་སུ་སྦས།
en: Sixteen, divided into right and left parts, Is concealed in the amount of thirty-two.

source: །བཅུ་དྲུག་ལས་ནི་བཞི་བཞིར་འགྱུར། །དྲུག་ཅུ་རྩ་བཞིའི་གྲངས་སུ་སྦས།
en: Sixteen, multiplied by four, Is concealed in the amount of sixty-four.

source: །མགྲིན་པ་ལོངས་སྤྱོད་འཁོར་ལོ་རུ། །རོ་དྲུག་ལ་ནི་ལོངས་སྤྱོད་པས། །རོ་མ་ལོངས་སྤྱོད་འཁོར་ལོར་སྦས།
en: At the throat, in the chakra of enjoyment, One enjoys the six flavors. Thus, Rasanā is concealed in the chakra of enjoyment.

source: །རྟ་མགྲིན་འཁོར་ལོ་མགྲིན་པར་སྦས།
en: The Hayagrīva chakra is concealed at the throat.

source: ། ཕྱི་ཡི་སྟོང་ཕྲག་བདུན་ཅུ་གཉིས། །ཤ་ལ་གནས་ནས་ཚིལ་བུ་སྐྱེད།
en: Seventy-two thousand external channels Are located in the flesh and give rise to fat.

source: །ནང་གི་བརྒྱ་དང་ཉི་ཤུ་ནི། །ཚིལ་ལ་གནས་ནས་རྐང་སྐྱེད་པའོ།
en: One hundred and twenty internal channels Are located in the fat and give rise to marrow.

source: །གསང་བ་སུམ་ཅུ་རྩ་གཉིས་ནི། །རུས་པར་གནས་ཤིང་ག་པུར་སྐྱེད།
en: Thirty-two secret channels Are located in the bones and give rise to camphor.

source: །དེ་ཁོ་ན་ཡི་རྩ་གསུམ་ནི། ། གསང་བར་གནས་ཤིང་བདེ་བ་བསྐྱེད།
en: The three suchness channels Are located in the secret place and give rise to bliss.

source: །ཁང་པ་སྟོང་ཕྲག་བདུན་ཅུ་གཉིས།
en: There are seventy-two thousand houses.

source: །ཁང་པ་རེ་ལ་ཁང་པ་འབུམ།
en: Each house has a hundred thousand further houses.

source: །ཁང་པ་དེར་གནས་སྲིན་བུའི་རིགས། །སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཏེ། །གྲངས་ནི་འབུམ་དུ་ཤེས་པར་བྱ།
en: The types of worms present in those houses Are seventy-two thousand and their number Should likewise be understood as multiplied by a hundred thousand.

source: །ནང་དང་གསང་བའི་རྩ་ལ་ཡང་། ། སྲིན་བུའི་རིགས་ནི་གྲངས་སུ་གསུངས།
en: It is taught that in the inner and secret channels The types of worms also correspond in number.

source: །དེ་ཁོ་ན་ཡི་རྩ་གསུམ་ལས། །འདོད་ཆགས་སྐྱེད་པའི་སྲིན་བུ་དགུ།
en: Within the three suchness channels Are nine worms that give rise to desire.

source: །ཉིན་དང་མཚན་མོ་མཚམས་དང་གསུམ། །དགུ་རུ་མཁས་པས་ཤེས་པར་བྱ།
en: With the triad of day, night, and twilight These should be understood by the adept as nine.

source: །རྩ་དེར་གནས་པའི་ག་བུར་ཡང་། །བདུད་རྩི་སྦྱོར་བ་ལས་བྱུང་བ།
en: The camphor located in those channels Is the ambrosia emergent from union.

source: ། བདུད་རྩི་ལ་སོགས་གོང་དུ་གསུངས།
en: Ambrosia and so forth has already been explained.

source: །ཡྃ་ལས་རླུང་གི་དཀྱིལ་འཁོར་དང་། །རྃ་ལས་མེའི་དཀྱིལ་འཁོར་བསམ།
en: Imagine that yaṁ becomes a maṇḍala of wind, And raṁ becomes a maṇḍala of fire.

source: །དེ་རུ་ཤ་ལ་སོགས་པ་དགོད།
en: Arrange the fleshes and so forth on it.

source: ། གཙོ་བོའི་སྟེང་དུ་སོར་བཞི་འམ། །མཐོ་གང་ཙམ་དུ་བསམ་པ་ནི།
en: Conceived as four finger-widths, or a full thumb-length above the central deity,

source: །དེ་སྟེང་ཨ་ལས་ཀ་པཱ་ལ། །པྃ་ལས་པདྨ་འདབ་བརྒྱད་བསམ། །ནང་དུ་ཟླ་བའི་དཀྱིལ་འཁོར་བསམ།
en: On top of this is the syllable a, which becomes a skull cup. Then paṁ becomes an eight-petal lotus. Imagine a moon disk inside of that.

source: །ཡི་གེ་གོ་བཟློག་བསམ་པར་བྱ།
en: One should visualize the syllables in reverse order,

source: །སྔོན་པོ་དམར་པོ་དཀར་པོ་
en: Blue, red, and white.

source: །ཧཱུྃ་ལས་གྱུར་པའི་རྡོ་རྗེ་བསམ། །དེ་སྟེངས་ཡི་གེ་མྃ་བསམ་ལ། །ཉི་མའི་དཀྱིལ་འཁོར་སྟེང་དུ་བསམ།
en: Imagine a hūṁ becoming a vajra. Above, visualize the syllable maṁ, Resting on a sun disk.

source: །འདི་ནི་བདུད་རྩིའི་ཁ་སྦྱོར་རོ།
en: This is the union of ambrosia.

source: །ཤ་ལྔ་ལས་ནི་གདན་ལྔར་གྱུར།
en: The five fleshes transform into the five seats.

source: །ལྕགས་ཀྱུ་བདུད་རྩི་ལྔ་རུ་འགྱུར།
en: The hooks transform into the five ambrosias.

source: །ལས་ཀྱི་རླུང་གིས་མེ་བུས་ཏེ། །ཟླ་བ་གཙོ་བོ་ལ་སོགས་ཞུ།
en: The karmic winds fan the flames, Which melts the moon, the central deity, and so forth

source: །ཐ་མལ་པ་ཡི་བདུད་རྩི་ཡིན།
en: This is ordinary ambrosia.

source: །ཡི་གེ་གསུམ་དང་ཉི་མ་ཞུ།
en: The three letters and the sun melt

source: །ལྷ་ཡི་བདུད་རྩི་ཞེས་ནི་བྱ།
en: This is called “divine ambrosia.”

source: །འོད་ཟེར་གྱིས་བཀུག་ཡེ་ཤེས་ཀྱི། །བདུད་རྩི་ཡིན་པ་རང་ཡིས་གསུངས།
en: That which is summoned by light rays I have taught to be wisdom ambrosia.

source: །ལན་གསུམ་བསྐོར་བ་སྐུ་གསུང་ཐུགས། །འདི་ནི་བྱིན་བརླབས་རྣལ་འབྱོར་རོ།
en: Circumambulating three times, enlightened body, speech, and mind, Is the practice of blessing.

source: ་བདུད་རྩི་མྱང་དང་མཆོད། །མཆོད་པའི་རྣལ་འབྱོར་ཞེས་ནི་གསུངས།
en: Tasting and offering the ambrosia Is taught to be the “practice of offering.”

source: །དེ་ནས་ཞུ་བའི་རྣལ་འབྱོར་ཡང་། །མཉམ་པའི་རླུང་དང་གཏུམ་མོའི་མེས། །ཡེ་ཤེས་བཞི་ཡི་ངོ་བོར་གྱུར།
en: Next, in the practice of melting, The equalizing wind and the fire of inner heat Transform the subtle body into the essence of the four wisdoms.

source: །ཆ་གཅིག་བྱ་བ་ནན་ཏན་ཏེ། །སྲིན་བུ་ལས་ཀྱི་མཁའ་འགྲོ་མཆོད།
en: One part is concerted activity, Which the worms, the action ḍākinīs, offer.

source: །ཆ་གཅིག་མི་བསྐྱོད་རྣམ་སྣང་སྟེ། །ཤ་ཟའི་མཁའ་འགྲོ་མཉམ་པ་ཉིད།
en: One part, Akṣobhya and Vairocana, Is the flesh eating ḍākinī, equanimity.

source: །དེ་ནས་རོལ་པའི་རྣལ་འབྱོར་ཏེ། །གཡས་གཡོན་དགོངས་པ་ཤེས་པར་བྱ།
en: Then comes the practice of play Which should be understood to mean the right and left.

source: །ཆ་གཅིག་རླུང་དང་མཁྲིས་པ་
en: One part, wind and bile,

source: །མཁྲིས་པས་བད་ཀན་ལ་སོགས་པ།
en: hrough bile, phlegm and so forth,

source: །སོ་སོར་ཀུན་རྟོག་ཡེ་ཤེས་མཆོད།
en: Offers discriminating gnosis.

source: །ཆ་གཅིག་རང་བཞིན་མེད་པ་
en: One part, the lack of nature,

source: །མེ་ལོང་ལྟ་བུའི་ཡེ་ཤེས་ཀྱིས།
en: With mirror-like gnosis,

source: །རྡོ་རྗེ་མཁའ་འགྲོ་མཆོད་པར་མཛད།
en: The vajra ḍākinī offers.

source: །རླུང་ནི་རྡོ་རྗེ་མཁའ་འགྲོ་
en: Winds are the vajra ḍākinī,

source: །རྩ་ནི་ཡེ་ཤེས་མཁའ་འགྲོ་
en: The channels, the gnosis ḍākinī,

source: །ག་པུར་ཤ་ཟའི་མཁའ་འགྲོ་
en: Camphor is the flesh-eating ḍākinī,

source: །སྲིན་བུ་ལས་ཀྱི་མཁའ་འགྲོ་ཡིན།
en: Worms are the action ḍākinī.

source: །གཞན་ཡང་རྩ་ལ་སོགས་པ་ལ། ། མཁའ་འགྲོ་རྣམས་ཀྱི་བྱེ་བྲག་ཀུན། །གོ་རིམས་བཞིན་དུ་ཤེས་པར་བྱ།
en: Furthermore, all the particulars of the ḍākinīs That dwell in the channels and elsewhere Should be understood in the proper order.

source: །སྐུ་ནི་ལས་ཀྱི་མཁའ་འགྲོ
en: Enlightened body is the action ḍākinī.

source: །གསུང་ནི་ཤ་ཟའི་མཁའ་འགྲོའོ།
en: Enlightened speech is the flesh-eating ḍākinī.

source: ཐུགས་ནི་ཡེ་ཤེས་མཁའ་འགྲོ་ཡིན།
en: Enlightened mind is the gnosis ḍākinī.

source: །བདེ་ཆེན་རྡོ་རྗེ་མཁའ་འགྲོའོ།
en: Great bliss is the vajra ḍākinī.

source: །གཞན་ཡང་འཁོར་ལོ་དབུས་ནས་ནི། ། མཁའ་འགྲོའི་བྱེ་བྲག་ཤེས་པར་བྱ།
en: Furthermore, the particulars of the ḍākinīs Should be understood with respect to the central chakra.

source: །དགའ་བ་ལས་ཀྱི་མཁའ་འགྲོ་
en: Joy is the action ḍākinī,

source: །མཆོག་དགའ་ཤ་ཟའི་མཁའ་འགྲོའོ།
en: Supreme joy is the flesh-eating ḍākinī.

source: །རང་བཞིན་དགའ་བ་
en: Natural joy

source: །དཔའ་བོ་ཟླ་བའི་དཀྱིལ་འཁོར་
en: The ḍāka is the moon disk,

source: །མཁའ་འགྲོ་མ་ནི་ཉི་མའོ།
en: And the ḍākinī is the sun.

source: ། ཙཎྜ་ལཱི་ནི་ཉི་ཤུ་བཞི། །སྦས་པའི་འཁོར་ལོ་བཞི་རུ་ངེས།
en: The caṇḍalī, twenty-four, Are ascertained as the four chakras that conceal them.

source: །བདེ་ཆེན་ལོངས་སྤྱོད་འཁོར་ལོར་བསྡུ།
en: The great bliss chakra is absorbed within the enjoyment chakra.

source: །ལོངས་སྤྱོད་ཆོས་ཀྱི་འཁོར་ལོར་བསྡུ།
en: The enjoyment chakra is absorbed within the dharma chakra.

source: །ཐིག་ལེ་ལ་ནི་ཐམས་ཅད་འདུས།
en: Everything fuses into a seminal drop.

source: །གོང་དུ་བསྡུ་བའི་རིམ་པ་ཡང་།
en: As for the sequence of absorption above,

source: །དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་གདུགས། །ཤིང་གི་འཁྲུལ་འཁོར་སྦྱོར་བ་ཇི་བཞིན་ནོ།
en: It is also like the parasol of a universal monarch, Which is an assembly of wooden machinery.

source: །དཔེར་ན་ཉི་མའི་དཀྱིལ་འཁོར་གཅིག་ཉིད་ལ། ། ཉི་མའི་འོད་ཟེར་ཕྱོགས་བཅུ་དུ་མར་སྣང་། །དུ་མའི་འོད་ཟེར་དཀྱིལ་འཁོར་གཅིག་ཏུ་འདུས།
en: This is like how a single sun Shines throughout the ten directions, Yet its profusion of rays is fused with it.

source: །སྙིང་ག་ཆོས་གྱི་འཁོར་ལོར་བསྡུས་ནས་ཀྱང་།
en: Moreover, once absorbed into the dharma chakra at the heart,

source: །ཉི་ཟླའི་དཀྱིལ་ན་ཙ་ན་ཀ་ཡི་ཚད། །དེ་ཡི་དབུས་སུ
en: In the center of the sun and moon disc, the size of a chick pea,

source: ཐིག་ལེ་ཡུངས་ཀར་ཚད།
en: Is a seminal drop, the size of a mustard seed.

source: །སྔགས་ཕྲེང་བ་སྤུའི་ཉག་མ་ཙམ་གྱིས་ནི། །གཡོན་བསྐོར་གཡས་བསྐོར་དབྱངས་གསལ་སྦྲུལ་ལྟར་འཁྱིལ།
en: Around this, on the left and right, Is a mantra garland as fine as a strand of hair. The vowels and consonants enwrap the drop like a snake.

source: །དེ་དག་ཐིག་ལེའི་རྣལ་འབྱོར་
en: Those are the practice of the seminal drop.

source: །འདི་ལ་སེམས་ནི་བརྟན་འགྱུར་ནས། །དེ་ནས་ཕྲ་མོའི་རྣལ་འབྱོར་བསྒོམ།
en: Once the mind has become stable in this, One may meditate on the subtle practice.

source: །ཟླ་བ་ཨཱ་ལི་ཀཱ་ལི་ལ། །ཨཱ་ལི་ཉི་མ་ལ་ཐིམ་ནས། །ཉི་མ་ཞབས་བསྐྱེད་ལ་ཐིམ་བསམ།
en: Imagine that the moon dissolves into the letters, The letters dissolve into the sun, And then the sun dissolves into the u vowel diacritic.

source: །ཞབས་བསྐྱེད་ལ་སོགས་རིམ་པར་ཐིམ།
en: The u vowel diacritic and the rest then gradually dissolve.

source: །ཡན་ལག་ལྔ་ནི་ཡེ་ཤེས་ལྔ།
en: The five limbs are the five gnoses.

source: །དེ་ནི་ཕྲ་མོའི་རྣལ་འབྱོར་
en: That is the subtle practice.

source: །དེ་ནས་ནཱ་ད་ཕྲ་མོ་ལ། །སེམས་ནི་རིམ་པར་བསྒོམ་པའོ།
en: Then, with one’s mind on the subtle nāda, One is to meditate in stages.

source: །དེ་ནས་རང་རིག་ཡེ་ཤེས་ཏེ། །ཆོས་ཀུན་སྟོང་པར་རོ་གཅིག་པའོ།
en: Then comes self-aware gnosis, In which all phenomena, being empty, are of one taste.

source: །གཞན་ཡང་ཆོས་ཀྱི་འཁོར་ལོ་དང་། །སྤྲུལ་པ་ཡི་ནི་འཁོར་ལོ་གཉིས། །འབར་བ་དང་ནི་འཛག་པའི་ཚུལ།
en: Moreover, the way in which The dharma chakra and the emanation chakra Drip and blaze

source: །ཕྱི་ཡི་རྣམ་རྟོག་རྩོལ་བ་
en: External concepts are exertion.

source: །ནང་གི་རྣམ་རྟོག་སྲོག་གི་རླུང་།
en: Internal concepts are the wind of vitality.

source: །སྲོག་རྩོལ་གཉིས་འགགས་དབུ་མ་
en: At the central channel where both vitality and exertion are constricted,

source: །ཀུན་རྫོབ་སྟེང་གི་སྣ་རྩེ་
en: Above the nose-tip of the relative,

source: །སོར་བཞི་ནས་ནི་རྩ་གསུམ་གཅིག
en: At a distance of four finger-widths, the three channels converge.

source: །དབུགས་དགག་པ་ཡི་གནས་ཡིན་པས།
en: Since this is the location where the breath is constricted,

source: །དང་པོར་དེ་རུ་གཟུང་བར་བྱ།
en: Initially, one should hold it there.

source: །དེ་ནས་སྤྲུལ་པའི་གནས་སུ་གཟུང་།
en: Then, hold it in the place of emanation.

source: །ཡང་ན་བགྲང་བར་ཤེས་པར་བྱ།
en: Alternatively, one should understand how to count it.

source: །དེ་ནས་གསང་བ་གསུམ་པ་ནི།
en: Next is the third secret.

source: །ཤེས་རབ་ཡེ་ཤེས་དང་འབྲེལ་བའི། །དགའ་བའི་མཚན་ཉིད་བཤད་པའོ།
en: It is explained as the basic character of joy In connection with the wisdom-gnosis initiation.

source: །གཞང་ཁ་གཡའ་ཞིང་བ་སྤུ་ལྡང་།
en: The anus quivers and the body hairs rise.

source: །དགའ་བའི་མཚན་ཉིད་མི་དམིགས་པ། །བཅུ་གཉིས་
en: Twelve non-observations of the basic character of joy

source: རང་བཞིན་ཡིན་པར་གསུངས།
en: Is taught to be its nature.

source: །བྱང་ཆུབ་སེམས་རྒྱུ་
en: the circulation of the spirit of enlightenment,

source: མི་རྟོག་སྙམ།
en: one reflects on non-conceptuality.

source: །མཆོག་དགའ་མི་དམིགས་ཉི་ཤུ་ལྔ།
en: Twenty-five non-observations of supreme joy

source: །གསང་བའི་ནོར་བུ་ཡོངས་སུ་གང་།
en: Completely fills the secret gem.

source: །ལྷན་ཅིག་སྐྱེས་དགའ་མི་དམིགས་པ།
en: The non-observation of innate joy

source: །ཆོས་ཀྱི་སྐུ་ནི་ཡིན་པར་གསུངས།
en: Is taught to be the dharma body.

source: །བདེ་བའི་རྒྱུན་ཆད་བྲལ་བའི་དགའ།
en: The interruption of the flow of bliss is the joy of cessation;

source: །དེ་ཡི་མི་དམིགས་གཟུགས་སྐུ་གཉིས།
en: Its non-observation is the two form buddha bodies.

source: །གཞན་ཡང་སྔོན་དུ་འགྲོ་བ་རྣམས། །ཡན་ལག་ཐབས་དང་སྦྱོར་བ་དངོས། །དགོངས་པ་དང་བཅས་རིམ་པའོ།
en: Moreover, all the preliminaries, The subsidiary techniques, and actual union, Along with their intention, are in stages.

source: །ཉི་མ་ཟླ་བ་ལྟ་བུར་ཟུང་འཇུག་ཀྱང་།
en: Despite coalescing like the sun and moon,

source: ། ཉི་མ་ཟླ་བ་ལྟ་བུར་ཟུང་དུ་འཇུག
en: They coalesce like the sun and moon.

source: །སྒྲ་གཅན་ལྟ་བུར་གཉིས་སུ་མེད་པའོ།
en: They are non-dual like an eclipse.

source: །སྐར་མའི་ཚོགས་ནི་ཇི་ལྟ་བུ།
en: What is a cluster of stars?

source: །ཟུང་དུ་འཇུག་པ་ཇི་ལྟ་བུ
en: What is coalescence?

source: །གཉིས་སུ་མེད་པ་ཇི་ལྟ་བུ།
en: What is non-duality?

source: །བྱང་ཆུབ་སུམ་ཅུ་རྩ་བདུན་ནི།
en: The thirty-seven factors of enlightenment

source: །རྒྱུ་ཡི་ཁྱད་པར་སྤྲོས་པའོ།
en: Are radiated as the features of the cause.

source: །སྐུ་གསུམ་དང་ནི་ཡེ་ཤེས་ལྔ།
en: The three buddha bodies and the five gnoses

source: །འབྲས་བུའི་ཁྱད་པར་སྤྲོས་པ་ཡིན།
en: Are radiated as the features of the fruition.

source: །རྒྱུ་རྣམས་བདུན་དུ་བསྡུ་བ་དང་། །འབྲས་བུ་གསུམ་དུ་བསྡུ་བའོ།
en: The causes are absorbed within seven And the fruitions are absorbed within three.

source: །རྒྱུ་རྣམས་འབྲས་བུ་ལ་ཐིམ་
en: The causes dissolve into the fruitions,

source: སྟེ། །འབྲས་བུ་གཉིས་སུ་བསྒོམ་པར་བྱ།
en: and The fruition should be meditated upon as two-fold.

source: །ཆོས་ཀུན་སེམས་ཀྱི་ངོ་བོ་
en: All phenomena are the essence of mind.

source: །སེམས་ནི་སྟོང་པའི་རང་བཞིན་ཡིན།
en: Mind is of an empty nature.

source: །ཐམས་ཅད་སྟོང་པར་རོ་གཅིག་པ།
en: All is of one taste in being empty.

source: །འདི་ནི་བླང་དོར་མེད་པའི་དབྱིངས།
en: This is the expanse devoid of accepting and rejecting.

source: །འདོད་ཆགས་རྣམ་པར་དག་བྱའི་ཕྱིར།
en: In order to fully purify desire,

source: །འདོད་ཆགས་སྐུ་ཡི་ཕྱག་རྒྱ་ལྔ། །ཕྱག་རྒྱ་ཆེན་པོ་ཡེ་ཤེས་གཉིས། །དམ་ཚིག་ཆོས་དང་ལས་ཕྱག་རྒྱ། །འདི་ལ་བརྟེན་པ་ཤིན་ཏུ་ཟབ།
en: Desire rooted in the five seals of enlightened body— The pair of the great seal and the gnosis seal, Along with the samaya seal, the dharma seal and the action seal— Becomes exceedingly profound.

source: །འདི་ནི་བདེ་བ་ཆེན་པོ་སྟེ། །བསྐྱེད་དང་རྫོགས་པའི་རང་བཞིན་དག །བདེ་ཆེན་འཁོར་ལོ་རྣམ་པ་གསུམ།
en: This is great bliss, which is three-fold— The natures of development and completion, And the chakra of great bliss.

source: །གསང་བའི་སྣ་རྩེ་ཨེ་ལ་གནས།
en: abides as the letter e at the secret nose-tip.

source: །སྤྲུལ་པའི་འཁོར་ལོ་གང་བ་
en: fills the emanation chakra,

source: གསང་བ་བདེ་སྐྱོང་བ་ལ་གནས།
en: Abides in the Secret Guardian of Bliss.

source: རང་བཞིན་བདེ་ཆེན་འཁོར་ལོ་སྟེ། །བདེ་བ་ཆེན་པོས་རོས་གང་བ།
en: The natural chakra of great bliss Is replete with the flavor of great bliss,

source: །ཏིལ་དང་ཏིལ་མར་ཇི་བཞིན་ནོ།
en: Just as a sesame seed is with sesame butter.

source: །དཔེར་ན་ཤིང་སྣ་བཅད་པ་ལས། །འོ་མ་འཛག་པ་ཇི་བཞིན་ནོ།
en: Like sap dripping From a cut tree branch,

source: །བདེ་བ་ཆེན་པོ་དེ་ཉིད་ལས།
en: From that great bliss itself

source: །སྐྲ་ཡི་རྩེ་མོ་བརྒྱ་སྟོང་དང་། །ཁྲི་དང་འབུམ་གྱི་རྣམ་པ་
en: the Form of hundreds, thousands, Tens of thousands, and hundreds of thousands of tips of hair.

source: །གཉིས་པ་དུ་བ་ལྟ་བུའོ།
en: The second resembles smoke.

source: །གསུམ་པ་གློག་གི་རྣམ་པ་སྟེ།
en: Third is the form of lightning;

source: བཞི་པ་མར་མེ་ལྟ་བུའོ།
en: The fourth resembles a butter lamp.

source: །འདི་དག་ཀུན་གྱི་རིམ་པ་ཡང་།
en: The sequence of all these, moreover,

source: །སྤྲིན་གྱི་རྣམ་པ་སྐྱེ་བ་ནི། །ཨ་ནི་སྐྱེ་བའི་མཚན་མ་ཡིན།
en: The emergence of the form of cloud Is the sign for birth, the syllable a.

source: །སྤྲུལ་པ་ལ་སོགས་རིམ་པ་བཞིན།
en: according to the order of the emanation chakra and the rest.

source: །མར་མེ་ལྟ་བུ་འཆི་བ་ཡིས། །ཧྃ་གི་མཚན་མར་གསུངས་པ་ཡིན།
en: That which resembles a butter lamp Is taught to be the sign of haṁ, for death.
